[
  {
    "brand": "Яскрава",
    "name": "Горох цукровий Альфа 50гр",
    "category": "654fcdaf0cb31d285bd7e951",
    "price": "10",
    "weight": "50гр",
    "left": 1,
    "starRating": 0,
    "packing": "Паперовий пакетик",
    "description": "Горох Альфа володіє відмінним смаком, багатий білками та харчовими волокнами, вітаміном В1 і С, іншими корисними елементами. Вживання свіжого або заготовленого овочу відмінно позначається на метаболізмі, роботі імунної системи, стані шкіри та волосся. Горошок містить багато вуглеводів і навіть трохи жирів та цукру, але його калорійність дуже низька — 75 ккал на 100 г свіжого продукту. Горох консервований зберігає всі речовини практично в тому ж обсязі, калорійність при цьому знижується до 55 ккал на 100 г. Найбільш корисні овочі, вирощені на своїй грядці, це відноситься і до зеленого горошку.",
    "imageUrl": "/products/yaskrava/gorox-zurk-alpha-50-hr.jpg",
    "code": "00002",
    "barcode": "4823069803155"
  },
  {
    "brand": "Яскрава",
    "name": "Горох цукровий Шеститижневий 50гр",
    "category": "654fcdaf0cb31d285bd7e951",
    "price": "10",
    "weight": "50гр",
    "left": 1,
    "starRating": 0,
    "packing": "Паперовий пакетик",
    "description": "Горох овочевий Шеститижневий — супер урожайний сорт. Він має високі смакові характеристики й універсальне застосування в кулінарії. Зелені боби їдять у свіжому вигляді, заморожують і консервують. Користь гороху незаперечна. Часте вживання виступає профілактикою атеросклерозу, серцево-судинних та онкозахворювань. Купити насіння гороху оптом вигідно у виробника, в інтернет-магазині Яскрава.",
    "imageUrl": "/products/yaskrava/gorox-six-50-hr.jpg",
    "code": "00003",
    "barcode": "4823069912208"
  },
  {
    "brand": "Яскрава",
    "name": "Горох цукровий Овочеве Диво 30г",
    "category": "654fcdaf0cb31d285bd7e951",
    "price": "10",
    "weight": "30г",
    "left": 1,
    "starRating": 0,
    "packing": "Паперовий пакетик",
    "description": "Свіжий горох — не просто літні ласощі, він важливе джерело білка, вітамінів і корисних елементів. Його широко використовують кулінари всього світу, поєднуючи з овочами, м'ясом, крупами. Сорт Овочеве диво подобається дітям за приємний смак, велику кількість горошин в стручку. Його можна консервувати, сушити, заморожувати, тому взимку ви зможете на повну користуватися рясним літнім урожаєм. Зелений горошок має низьку калорійність (55-75 ккал на 100 г), він рекомендований при дієтичному харчуванні, багатий на вітаміни групи В, достатньо в ньому аскорбінової кислоти та кремнію. Все це важливо для підтримки зростаючого організму, додання сил імунній системі.",
    "imageUrl": "/products/yaskrava/gorox-ovoch-dyvo-30-hr.jpg",

    "code": "00008",
    "barcode": "4823069803148"
  },
  {
    "brand": "Яскрава",
    "name": "Баклажан Айсберг 0,25 г",
    "category": "654fcdaf0cb31d285bd7e951",
    "price": "10",
    "weight": "0.25г",
    "left": 1,
    "starRating": 0,
    "packing": "Паперовий пакетик",
    "description": "unset",
    "imageUrl": "/products/yaskrava/unset.jpg",

    "code": "00009",
    "barcode": "4823099800346"
  },
  {
    "brand": "Яскрава",
    "name": "Баклажан Чорний Красень 0,3 г",
    "category": "654fcdaf0cb31d285bd7e951",
    "price": "10",
    "weight": "0.3г",
    "left": 1,
    "starRating": 0,
    "packing": "Паперовий пакетик",
    "description": "Баклажан Чорний красень класичної форми і насиченого чорного кольору з блискучою шкіркою є популярним серед приватних господарств України. За відгуками садівників, він простий у догляді й дає відмінні врожаї смачних плодів. Баклажани цього сорту вживають у тушкованому, смаженому, печеному вигляді, використовують для консервації та інших видів кулінарної обробки.",
    "imageUrl": "/products/yaskrava/eggplant-black-handsome.jpg",

    "code": "00010",
    "barcode": "4823069800048"
  },
  {
    "brand": "Яскрава",
    "name": "Баклажан Алмаз 0.3 г",
    "category": "654fcdaf0cb31d285bd7e951",
    "price": "10",
    "weight": "0.3г",
    "left": 1,
    "starRating": 0,
    "packing": "Паперовий пакетик",
    "description": "Сорт баклажана Алмаз вважається одним з найвигідніших у комерційному вирощуванні. Його щільні глянцеві плоди, за відгуками споживачів, відрізняються відмінним смаком і ідеальним балансом корисних речовин. Вони довго зберігаються і не бояться транспортування. Сорт відомий хорошою врожайністю - з одного куща можна зібрати до   6 кг баклажанів.",
    "imageUrl": "/products/yaskrava/eggplant-almaz-30hr.jpg",

    "code": "00011",
    "barcode": "4823069800017"
  },
  {
    "brand": "Яскрава",
    "name": "Баклажан Білий глобус 0.2 г",
    "category": "654fcdaf0cb31d285bd7e951",
    "price": "10",
    "weight": "0.2г",
    "left": 1,
    "starRating": 0,
    "packing": "Паперовий пакетик",
    "description": "Баклажан Білий глобус незмінно популярний серед садівників, завдяки своїй оригінальності. Його плоди виростають у формі майже правильної кулі і мають забарвлення від білого до рожевого, з першого погляду ніхто не може вгадати, що це за овоч. У діаметрі баклажани близько 12 см, їх шкірка тонка, а м'якоть дуже ніжна, без класичної гірчинки. За відгуками покупців, його смак ідеальний для закусок і салатів, підходить для смаження, тушкування або запікання. Час приготування - близько 10 хв.",
    "imageUrl": "/products/yaskrava/eggplant-white-globus.jpg",
    "code": "00012",
    "barcode": "4823069800031"
  },
  {
    "brand": "Яскрава",
    "name": "Перець Асті червоний 0.3 г ",
    "category": "654fcdaf0cb31d285bd7e951",
    "price": "10",
    "weight": "0.3г",
    "left": 1,
    "starRating": 0,
    "packing": "Паперовий пакетик",
    "description": "Перець Асті червоний дозріває рано, тому вже влітку червоні плоди з помаранчевим відтінком потішать вас солодкою м'якоттю, у якій, до всього іншого, багато корисних речовин. Завдяки тому, що сорт високоврожайний і може зберігатися тривалий час після збору, є достатньо часу для вживання у свіжому вигляді, а також для заготовок різноманітних зимових салатів і закусок.",
    "imageUrl": "/products/yaskrava/pepper-asti-red.jpg",
    "code": "00013",
    "barcode": "4823069813918"
  },
  {
    "brand": "Яскрава",
    "name": "Перець Ратунда 0.3 г ",
    "category": "654fcdaf0cb31d285bd7e951",
    "price": "10",
    "weight": "0.3г",
    "amount": "20",
    "left": 1,
    "starRating": 0,
    "packing": "Паперовий пакетик",
    "description": "Серед різноманіття сортів перців виділяють сорт Ратунда, який виділяється своєю незвичайною для перців округлою формою. Даний сорт ще називають томатоподібним. Забарвлення зустрічається різноманітне: від жовтого до глибокого червоного. Плоди за смаком переважно без гіркоти, солодкі, соковиті, прекрасно зберігаються і транспортуються. Низькорослі кущі, компактні, це дозволяє вирощувати їх, навіть, в умовах лоджії або балкона.",
    "imageUrl": "/products/yaskrava/pepper-ratunda.jpg",
    "code": "00014",
    "barcode": "4823069801267"
  },
  {
    "brand": "Яскрава",
    "name": "Перець Каліфорнійське Диво 0.3 г",
    "category": "654fcdaf0cb31d285bd7e951",
    "price": "10",
    "weight": "0.3г",
    "amount": "20",
    "left": 1,
    "starRating": 0,
    "packing": "Паперовий пакетик",
    "description": "Осінь – завершальний етап городнього сезону у дачників. Пора для збору багатого врожаю. Перець Каліфорнійське диво - одна з численних овочевих культур, яка завжди тішить неймовірними смачними плодами. Червоні плоди володіють насиченою солодкістю, хрусткістю і високим вмістом вітамінів. Універсальне застосування в кулінарії дозволяє приготувати найрізноманітніші страви з термічною обробкою і без неї.",
    "imageUrl": "/products/yaskrava/pepper-californian-miracle.jpg",
    "code": "00015",
    "barcode": "4823069801236"
  },
  {
    "brand": "Яскрава",
    "name": "Перець Оранжевий Дивосвіт 0.3 г",
    "category": "654fcdaf0cb31d285bd7e951",
    "price": "10",
    "weight": "0.3г",
    "amount": "20",
    "left": 1,
    "starRating": 0,
    "packing": "Паперовий пакетик",
    "description": "Особливу увагу заслуговує сорт перцю Помаранчевий Дивосвіт. Поєднує в собі такі якості як гідний урожай, невибагливість у догляді та відмінний смак, тому стане кращою знахідкою для кожного садівника-городника. Яскраві плоди корисні та поживні, прикрасять собою будь-яку страву. Завдяки чудовому відтінку овоча, як відзначають садівники, перці у маринаді та нарізці виглядають дуже ефектно.",
    "imageUrl": "/products/yaskrava/pepper-orange-miracleworld.jpg",
    "code": "00016",
    "barcode": "4823069801243"
  },
  {
    "brand": "Яскрава",
    "name": "Перець Богдан 0.3 г",
    "category": "654fcdaf0cb31d285bd7e951",
    "price": "10",
    "weight": "0.3г",
    "amount": "20",
    "left": 1,
    "starRating": 0,
    "packing": "Паперовий пакетик",
    "description": "Перець Богдан - скоростиглий сорт, виведений українськими селекціонерами, який володіє найкращими якостями цієї овочевої культури. Садівники люблять його за високий обсяг врожаю з тривалим періодом плодоношення. Яскраво-жовті плоди мають відмінний смак з високим вмістом вітаміну С та інших поживних речовин. Універсальне використання в кулінарії дозволяє приготувати безліч вишуканих і смачних страв.",
    "imageUrl": "/products/yaskrava/pepper-bohdan.jpg",
    "code": "00017",
    "barcode": "4823069801182"
  },
  {
    "brand": "Яскрава",
    "name": "Перець Асті жовтий 0.3 г",
    "category": "654fcdaf0cb31d285bd7e951",
    "price": "10",
    "weight": "0.3г",
    "amount": "20",
    "left": 1,
    "starRating": 0,
    "packing": "Паперовий пакетик",
    "description": "Перець Асті жовтий - один з найкращих представників сортів перців кубовидної форми. Жовті, солодкі плоди багаті вітамінами, а також вважаються рекордсменами серед овочів за вмістом вітаміну С. Підходить для вирощування у відкритому ґрунті і абсолютно не вибагливий у догляді. Також перець сорту Асті відмінно адаптований до погодних умов наших широт.",
    "imageUrl": "/products/yaskrava/pepper-asti-yellow.jpg",
    "code": "00018",
    "barcode": "4823069813925"
  },
  {
    "brand": "Яскрава",
    "name": "Томат Мікадо рожевий 0.1 г",
    "category": "654fcdaf0cb31d285bd7e951",
    "price": "10",
    "weight": "0.1г",
    "amount": "20",
    "left": 1,
    "starRating": 0,
    "packing": "Паперовий пакетик",
    "description": "Томат Мікадо рожевий середньоранній сорт. Люблять його за цукровий, ароматний смак і великий розмір плодів. Досить одного помідора, щоб приготувати свіжий салат на всю сім'ю, а завдяки відмінну лежкість, можна довго насолоджуватися томатами цього сорту.",
    "imageUrl": "/products/yaskrava/tomato-mikado-pink.jpg",
    "code": "00019",
    "barcode": "4823069810344"
  },
  {
    "brand": "Яскрава",
    "name": "Томат Хурма 0.1 г",
    "category": "654fcdaf0cb31d285bd7e951",
    "price": "10",
    "weight": "0.1г",
    "amount": "20",
    "left": 1,
    "starRating": 0,
    "packing": "Паперовий пакетик",
    "description": "Яскраво-помаранчеві томати Хурма з ніжним і солодким смаком дуже люблять діти і дорослі. Завдяки високому вмісту каротину ці помідори вважаються одними з найбільш корисних для здоров'я. За відгуками, цей сорт добре продається, невибагливий у вирощуванні, підходить для тривалого зберігання. Багато фермерських господарств вважають його дуже перспективним. ",
    "imageUrl": "/products/yaskrava/tomato-hurma.jpg",
    "code": "00020",
    "barcode": "4823069801601"
  },
  {
    "brand": "Яскрава",
    "name": "Томат Чорний принц 0.1 г",
    "category": "654fcdaf0cb31d285bd7e951",
    "price": "10",
    "weight": "0.1г",
    "amount": "20",
    "left": 1,
    "starRating": 0,
    "packing": "Паперовий пакетик",
    "description": "Томат Чорний принц бордового кольору цінується за свій зовнішній вигляд і відмінний смак. Використовується в салатах, додається в готові страви як прикраса, є основою супів і соусів. За відгуками садівників, вони люблять помідори Чорний принц ще й за простоту в догляді. Він чуйний до підживлення, невибагливий і не схильний до захворювань.",
    "imageUrl": "/products/yaskrava/tomato-black-prince.jpg",
    "code": "00021",
    "barcode": "4823069801656"
  },
  {
    "brand": "Яскрава",
    "name": "Томат Волове серце золоте 0.1 г",
    "category": "654fcdaf0cb31d285bd7e951",
    "price": "10",
    "weight": "0.1г",
    "amount": "20",
    "left": 1,
    "starRating": 0,
    "packing": "Паперовий пакетик",
    "description": "Томат Бичаче серце золоте відрізняється класичною для цього виду формою і незвичайним золотисто-оранжевим забарвленням. Великі помідори містять солодку соковиту м'якоть, що містить безліч камер з насінням. Фахівці збігаються в своїх відгуках, даючи сорту високу дегустаційну оцінку і відносячи його до солодких салатних сортів.",
    "imageUrl": "/products/yaskrava/tomato-volove-heart-gold.jpg",
    "code": "00022",
    "barcode": "4823069861230"
  },
  {
    "brand": "Яскрава",
    "name": "Томат Волове серце 0.1 г",
    "category": "654fcdaf0cb31d285bd7e951",
    "price": "10",
    "weight": "0.1г",
    "amount": "20",
    "left": 1,
    "starRating": 0,
    "packing": "Паперовий пакетик",
    "description": "Томати Волове серце давно завоювали любов серед цінителів помідорів, їх вирощують і купують із задоволенням. За відгуками садівників, незважаючи на непросте вирощування, цей сорт щороку висаджується майже в кожному саду України. Великі червоні помідори у формі серця дуже соковиті, з насиченим смаком і великою кількістю вітамінів.",
    "imageUrl": "/products/yaskrava/tomato-volove-heart.jpg",
    "code": "00023",
    "barcode": "4823069802608"
  },
  {
    "brand": "Яскрава",
    "name": "Томат Санька 0.1 г",
    "category": "654fcdaf0cb31d285bd7e951",
    "price": "10",
    "weight": "0.1г",
    "amount": "20",
    "left": 1,
    "starRating": 0,
    "packing": "Паперовий пакетик",
    "description": "Томат Санька - червоний ранній сорт з хорошою врожайністю і відмінним смаком. За відгуками кулінарів, він ідеальний для легких літніх салатів, він заряджає свіжістю і вітамінами, підходить також для всіх видів закусок. Відрізняється простотою в догляді і стійкістю до багатьох захворювань, за це його цінують фермери і власники приватних городів.",
    "imageUrl": "/products/yaskrava/tomato-sanka.jpg",
    "code": "",
    "barcode": ""
  },
  {
    "brand": "Яскрава",
    "name": "Томат Новічок 0.1 г",
    "category": "654fcdaf0cb31d285bd7e951",
    "price": "10",
    "weight": "0.1г",
    "amount": "20",
    "left": 1,
    "starRating": 0,
    "packing": "Паперовий пакетик",
    "description": "unset",
    "imageUrl": "/products/yaskrava/unset.jpg"
  },
  {
    "brand": "Яскрава",
    "name": "Томат Рiо Гранде 0.1 г",
    "category": "654fcdaf0cb31d285bd7e951",
    "price": "10",
    "weight": "0.1г",
    "amount": "20",
    "left": 1,
    "starRating": 0,
    "packing": "Паперовий пакетик",
    "description": "unset",
    "imageUrl": "/products/yaskrava/unset.jpg"
  }
]
