import { writeFile } from "fs";

const text = `
Горох цукровий Альфа 50 гр
Горох цукровий Шеститежневий 50 гр
Горох цукровий овочеве диво 30 гр
Баклажан Айсберг 0,25 гр
Баклажан Чорний красень 0,3 гр
Баклажан Алмаз 0,3 гр
Баклажан Глобус білий 0,2 гр
Перець Асті червоний 0,3 гр
Перець Ратунда 0,3 гр
Перець Каліфорнійське диво 0,3 гр
Перець Оранжевий дивосвіт 0,3 гр Перець Богдан 0.3 гр
Перець Асті жовтий 0,3 гр.
Томат Мікадо рожевий 0,1 гр
Томат Хурма 0,1 гр
Томат Чорний принц 0,1 гр
Томат Волове серце Золоте 0,1 гр
Томат Волове серце 0,1 гр.
Томат Санька 0,1 гр
Томат Новічок 0,1 гр.
Томат Ріо гранде 0,1 гр
Томат Кібіц 0,1 гр
Томат Де Барао Помаранчевий 0,1 гр
Томат Гібрід Тарасенко 0,1 гр
Томат Загадка 0,1 гр
Томат Чері червоний 0,1 гр
Капуста б/г 10гр Лежка
Капуста б/г 10 гр Харківська зимова
Капуста б/г 10 гр Іюньська
Кабачок Чаклун 20 гр.
Кабачок Світозар 20 гр.
Кабачок Кущовий 20 гр
Огірок Син полка F1 мінікорнішон 0,5 гр (15-20 нас)
Огірок Паризький корнішон 1,0 гр
Огірок кущовий 1.0 гр
Огірок Сусіду на заздрість F1 0,5 гр
Огірок Фенікс плюс (50-60) 1,0гр
Огірок Посухостійкий 1.0 гр
Новина Огірок Китайське Диво 0,5 гр
Огірок Роднічок F10.5 гр (15-25 нас)
Огірок Кум да кума F10.5 гр
Кріп Грибівський 20 гр
Кріп Асторія кущовий 20 гр
Кріп Харківський 20гр
Петрушка Карнавал дрібнолисткова 20 гр
Петрушка Гігантела великолисткова 20 гр
Петрушка кучерява Парамоунт 10 гр
Петрушка коренево листкова Богатир 20 гр
Кріп Харківський 5гр
Кріп Асторія кущовий 5гр
Щавель Широколистковий 2гр
Шпинат Матадор 2 гр рукола 1.0 гр
Рукола дика 0,5 гр
Базилік Зелений 0.3 гр
Салат Айсберг (хрусткий) 1 гр
Салат Малинова Куля 1 гр
Салат Одеський кучерявець 2гр
Салат Сніжинка 2гр
Салат Кресс 2гр
Редис Сора 10 гр
Буряк столовий Делікатесний 20 гр
Буряк столовий Єгипетський плескатий 20гр
Буряк столовий вінігретний 20 гр
Буряк столовий Червона куля 20 гр
Буряк столовий Опольський 20 гр
Морква Лангероте Штумпфе 10 гр
Морква королева осені 10 гр
Морква Вітамінна 10 гр
Морква Оленка 10 гр.
Морква Дитяча солодка 10 гр
Морква Віта Лонга 10 гр
Морква Шантане 10 гр
Морква Нантська 10 гр
Огірок Алладін F10,5 гр(15-20 нас)
Базилік Червоний рубін 0,2 гр
Редис 18 днів 10 гр
Щелкунчик зерно 315 г.
Томат Перцевидний
Кабачок Єлоу Хаус
Капуста Білоголова Мегатон
Кобея Білі Вітрила
Бегонія Бада Бінг
Сальвія Блискуча Ракета
Кукурудза Оверленд
Баклажан Вайт Егг
Сальвія Блискуча Червоний гном
Редиска Пасхальні яйця
Редька Чорна 10 гр
Буряк Циліндра 10гр
Арахіс 20гр
Дайкон Агата 10гр
Редис Льодяна бурулька 10гр
Буряк Риваль 10гр
Ярос 250 мл
Кукурудза Любава/Кадр /фас 1 кг
Буряк кормовий Бригадир 200 гр.
Редис Базис 15гр.
Редис Сора 10гр
Кавун Чарльстон Грей 10гр.
Петрушка кучерява Парамоунт 1 грр
Кукурудза Попкорн 50гр
Гарбуз Новинка 2гр
Капуста б/г Білосніжка 10гр.
Гарбуз Український Багатоплідний 20гр
Томат Рання Любов 0.1гр
Зимовіт бут. 1л
Брунька 20мл (блістер)
Морква Оленка 20 грр.
|Кавун Янусик 1 гр
Огірок Маша Ф1 10 насінин
Капуста Пекінська Монако Ф1 20 насінин
Фіалка Біколор 0.05гр
Фіалка Лаура 0.05гр
Фіалка Кардинал 0.05гр
Фіалка Лорд Біконсфільд 0.05гр
Фіалка Марс 0.05гр
Фіалка Чорний Король 0.05гр
Квасоля Червона Шапочка кущова 20гр
Квасоля Перепілочка кущова 20гр
Квасоля Файний Ясь кущова 30гр
Квасоля Мавка кущова 30гр
Диня Карамель 10гр
Патісон жовтий 2гр
Айстра Принцеса Кріспіна 0.25 гр
Айстра Сива дама червона 0.25гр
Айстра Айстра Принцеса суміш 0.25гр
Айстра Низька суміш 0.25гр
Айстра Крален люкс 0.25гр
Горох Альфа 100гр
Буряк Опольский 20гр
Буряк Циліндра 20гр
Фарба Блок Мідний купорос 4 кг
Буряк Цукровий 0.5 кг
Мікрозелень Руккола 10гр
Щавель Широколистковий 10гр
Редис Французький сніданок 3 гр
Препарат 30в 900мл
Фітоверм 2мл
Фарба садова Блок Мідний купорос 1.4кг
Огірок Цезар Ф1 4гр.
Огірок Засолочний 5гр
Огірок Журавльонок Ф1 5гр
Огірок На Заздрість Сусіду Ф1 4гр
Щелкунчик гранула 150 гр(зелена)
Буряк Столовий округлий Темно-червоний 10 гр
Буряк округлий темно-червоний 10 гр
Морква Дитяча солодка 10 гр
Морковь Лосиноостровская 20 гр
Морква Без серцевини 20 гр
Буряк Делікатесний 10 гр
Петрушка Листова Гігантела 10 гр
Кріп Геркулес 10 гр
Морква Лосиноострівська 10 гр
Кріп Алігатор 15 гр
Матіола дворога 5гр
Матіола дворога 1 гр
Горох Овочеве диво 100 гр
Фасоля спаржева Зіронька 20 гр
Чорнобривці низькі Оранж Зг
Чорнобривці низькі Цукрова суміш 3 гр
Петрушка Листова Карнавал 10 гр
Чорнобривці низькі прямостоячі Оранж 3 гр
Щавель Одеський 17 20гр
Кабачок Гайдамака 15 гр
Буряк Бордо 237 20гр. Буряк Циліндра 20гр
Морква Шантане 10гр.
Редис Французький Сніданок 10гр
Редиска Жара 15 гр
Меліса Лимонна 0.2гр
Огірок Сусіду на заздрість Ф1 2.5гр
Буряк Вінегретний Зг
Щавель Одеський 17 2гр.
Редиска Льодяна Бурулька 2гр
Огірок Кущовий Корнішон 1 гр
Редиска Червона з білим кінчиком 2гр.
Буряк Пабло Ф1 200шт.
Морква Канада Ф1 400шт
Буряк Червона куля 20гр Польша
Редька Червона з білим кінчиком 15 гр
Огірок Кум да Кума Ф1 5гр.
Огірок Паризький Корнішон 5гр
Редька Французький сніданок 2гр
Тютюн Запашний суміш 0.2гр
Огірок Теща Ф15гр.
Горох Фаворит 30гр
Горох Бінго 30гр
Горох Тристар 100гр
Горох Шуга Бон 100гр.
Кукурудза Білий Кролик 200 насінин
Соняшник Махровий низький жовтий 1 гр
Геліхризум Суміш високмй 0.2гр.
Кермек Рожева гірлянда 0.2гр
Кораген 4мл
Осотин 2гр
Колібріс 3мл
Редиска 18 днів 15 гр
Кавун Красень 2гр
Морква Королева Осені 20гр
Диня Рання 133 2гр.
Морква Без серцевини 10гр
Редис Богиня 10гр
Кабачок Золотинка 20гр
Квасоля кущова Зіронька 15 гр
Квасоля кущова спаржева Лібра 15 гр
Горох Дінга 100гр
Горох Адагумський 50гр
Квасоля спаржева Сонеста 10гр
Квасоля спаржева Лаура 20гр
Квасоля кущова Ластівка 30гр
Шпинат Матадор 20гр
Буряк Негретьонок Зг
Буряк Делікатесний 3гр
Чорнобривці відхилені Спрей Петіт 5гр
Матіола Запашна 10гр.
Чорнобривці відхилені Танджерін 5гр
Редька Французький Сніданок 15гр
Біб Янкель Білий 20гр
Чорнобривці відхилені Голд Копфен 0.5гр
Диня Ананас 1гр
Кавун Ау-Продюсер 20 насінин
Кавун Чарльстон Грей 1 гр
Кавун Цільнолисий 1 гр
Кукурудза цукрова Делікатесна 20гр
Салат Одеський кучерявець 10гр
Салат Австралійский 5гр
Салат Майська Королева 10гр
Щавель Широколистий 10гр
Редиска Рання червона 15 гр
Редис Ранній червоний 10гр
Кабачок Світозар 15 гр.
Кабачок Кущовий 15гр
Кукурудза цукрова Багратіон Ф1 15 гр.
Кукурудза цукрова Спокуса Ф1 20гр
Кабачок Грибовський 15гр.
Кабачок Гайдамака 15 гр
Кукурудза Брусниця 20гр
Квасоля спаржева Ольга 20гр
Кукурудза Фіона Ф1 50 насінин
Петрушка Карнавал 2гр
Буряк Опольский 10гр Буряк Риваль 20гр
Гарбуз Кущовий Помаранчевий 20гр
Гарбуз Болгарка 20грр
Гарбуз Волозький сірий 10гр.
Патисон Перлинка Зг
Огірок Аякс Ф1 50 насінин
Огірок Альошаф 1 4грр.
Огірок Конкурент 5грр
Огірок Ніжинський 5гр
Огірок Кущовий 5гр
Огірок Анулька Ф1 4гр
Квасоля спаржева Скуба 10гр
Огірок Кріспіна Ф1 10 насінин
Жоржина Веселі хлопчата суміш 2гр
Огірок Амур Ф1 10 насінин
Квасоля спаржева Кропер Тіпі 10гр
Пацюк Клейова пастка 110*160мм
Харума 100мл
Оберіг 100мл
Мастер-Агро 100 гр Томат, перець, баклажан 25.15.15
Мастер-Агро 100гр Огірок, кабачок, патисон 22.8.16
Мастер-Агро 100гр для ягідних культур
Рамзес 5гр + Альфалип 25мл
Кислота Борна 20гр
Оберіг 15мл
Кукурудза Поп корн Вулкан 15гр
Крисина смерть No1 тісто 200гр.
Крисина смерть No2 тісто червоне 200гр
Щелкунчик шашка від крота 6 патронів
Анти Муравін 50грр`;

async function writeToFile(data, path) {
  try {
    await writeFile(path, JSON.stringify(data, null, 2), (err) => {
      if (err) throw err;
      console.log("File has been saved!");
    });
    console.log("Data written to file");
  } catch (error) {
    console.error(`Error writing data to file: ${error}`);
  }
}
const lines = text.split("\n");
const regex = /(\d+(?:[.,]\d+)?\s*гр\.?)/;

const objects = lines.map((line) => {
  const match = line.match(regex);
  return {
    name: line.trim(),
    weight: match ? match[0].trim() : null,
  };
});

writeToFile(objects, "yaskrava1c.json");

// console.log(objects); //
