import s from "./privacy_policy.module.scss";

const Policy = () => {
  return (
    <article className={s.privacy_policy}>
      <dl>
        <dt>Положення про обробку і захист персональних даних</dt>
        <dd>
          Це Положення визначає порядок обробки та захисту персональних даних
          користувачів, які відвідують сайт <strong>Живий світ</strong>.
        </dd>

        <dt>Збір персональних даних</dt>
        <dd>
          Ми збираємо персональні дані, такі як ім'я, контактний номер телефону,
          електронна адреса, адреса доставки товарів, які ви надаєте добровільно
          під час реєстрації або замовлення на сайті.
        </dd>
        <dt>Використання даних</dt>
        <dd>
          Персональні дані використовуються для обробки замовлень, надання
          консультацій, відправлення інформації про акції та новинки, та
          покращення якості обслуговування.
        </dd>
        <dt>Захист даних</dt>
        <dd>
          Ми вживаємо всіх необхідних технічних та організаційних заходів для
          захисту ваших персональних даних від несанкціонованого доступу, зміни,
          розголошення або знищення.
        </dd>
        <dt>Права користувача</dt>
        <dd>
          Ви маєте право вимагати доступу до ваших персональних даних, їх
          виправлення, видалення або обмеження обробки, а також право
          заперечувати проти обробки та право на переносимість даних.
        </dd>
        <dt>Маєте запитання?</dt>
        <dd>
          Для звернення з питань конфіденційності, будь ласка, зв'яжіться з нами
          через <a href="mailto:privacy@zhyvysvit.ua">privacy@zhyvysvit.ua</a>.
        </dd>
      </dl>
    </article>
  );
};

export default Policy;
