import s from './terms_of_usage.module.scss';

export const TermsOfUsage = () => {
  return (
    <article className={`${s.terms_of_usage}`}>
      <dl>
        <dt>
          <h1>Угода користувача</h1>
        </dt>
        <dd>
          <p>
            Ласкаво просимо до «Живого світу», веб-додатку електронної комерції
            для продажу товарів для догляду за тваринами та домашнього вжитку.
            Ця Угода користувача (далі – «Угода») встановлює умови використання
            нашого веб-сайту та послуг.
          </p>
        </dd>

        <dt>
          <h2>Прийняття умов</h2>
        </dt>
        <dd>
          <p>
            Отримуючи доступ та використовуючи наш веб-сайт, ви приймаєте та
            погоджуєтесь дотримуватися умов цієї Угоди. Якщо ви не згодні
            дотримуватися цих умов, будь ласка, не використовуйте та не
            отримуйте доступ до наших послуг.
          </p>
        </dd>

        <dt>
          <h2>Реєстрація</h2>
        </dt>
        <dd>
          <p>
            Хоча ви можете переглядати наш веб-сайт без реєстрації, вам потрібно
            буде зареєструватися, щоб зробити покупку та отримати доступ до
            деяких функцій. Ми можемо змінювати вимоги до реєстрації від часу до
            часу.
          </p>
        </dd>

        <dt>
          <h2>Конфіденційність</h2>
        </dt>
        <dd>
          <p>
            Ваша конфіденційність дуже важлива для нас. Щоб краще захистити ваші
            права, ми надали вам нашу Політику конфіденційності, яка пояснює
            наші практики та вибір, який ви можете зробити щодо способу збору та
            використання вашої інформації нами. Будь ласка, прочитайте це, щоб
            дізнатися більше про наші політики даних.
          </p>
        </dd>

        <dt>
          <h2>Замовлення та оплата</h2>
        </dt>
        <dd>
          <p>
            При замовленні товару через наш веб-сайт, ви погоджуєтесь надати
            вірну та точну інформацію про себе та контактні дані. Ви також
            погоджуєтесь оплатити всі замовлені товари, які ви придбали, та
            визнаєте, що ціни можуть змінюватися між вашим часом замовлення та
            часом оплати.
          </p>
        </dd>

        <dt>
          <h2>Повернення та відміна замовлень</h2>
        </dt>
        <dd>
          <p>
            Ми пропонуємо повернення та відміну замовлень відповідно до нашої
            Політики повернення. Будь ласка, ознайомтеся з нею, щоб дізнатися
            більше про ваши права та обов'язки.
          </p>
        </dd>

        <dt>
          <h2>Зміни в Угоді</h2>
        </dt>
        <dd>
          <p>
            Ми можемо періодично оновлювати цю Угоду. Ви погоджуєтесь перевіряти
            цю Угоду періодично, щоб бути в курсі таких оновлень. Ваше
            продовження використання нашого веб-сайту після таких оновлень
            становить вашу згоду на дотримання та прийняття оновленої Угоди.
          </p>
        </dd>

        <dt>
          <h2>Контакти</h2>
        </dt>
        <dd>
          <p>
            Якщо у вас є питання щодо цієї Угоди або використання нашого
            веб-сайту, будь ласка, зв'яжіться з нами за адресою:
            support@liveworld.com
          </p>
        </dd>
      </dl>
    </article>
  );
};

export default TermsOfUsage;
